
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 42 to add, 16 to change, 1 to destroy.</code></pre>

* Create
  * azapi_update_resource.ams02_auth
  * azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[1]
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER
  * azurerm_managed_disk.dtgtwaydatadisk[0]
  * azurerm_managed_disk.dtgtwaydatadisk[1]
  * azurerm_media_services_account.ams02
  * azurerm_network_interface.dtgwnic[1]
  * azurerm_private_endpoint.finalsa
  * azurerm_private_endpoint.ingestsa
  * azurerm_private_endpoint.sa
  * azurerm_role_assignment.mi_storage_1
  * azurerm_role_assignment.mi_storage_2
  * azurerm_route_table.postgres
  * azurerm_subnet_route_table_association.dg_subnet
  * azurerm_virtual_machine_data_disk_attachment.dtgtwy[0]
  * azurerm_virtual_machine_data_disk_attachment.dtgtwy[1]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[0]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[1]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[0]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[1]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[0]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[1]
  * azurerm_virtual_machine_extension.dtgtwymsmonitor-agent[0]
  * azurerm_virtual_machine_extension.dtgtwymsmonitor-agent[1]
  * azurerm_virtual_network_peering.from-hub
  * azurerm_virtual_network_peering.to_hub
  * azurerm_windows_virtual_machine.dtgtwyvm[0]
  * azurerm_windows_virtual_machine.dtgtwyvm[1]
  * null_resource.amsid_1
  * module.data_store_db_v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_database.pg_databases[&#34;pre-pdb-stg&#34;]
  * module.data_store_db_v14.random_password.password
  * module.dynatrace-oneagent-dtgtway[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.dynatrace-oneagent-dtgtway[1].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.finalsa02_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa02_storage_account.azurerm_storage_account.storage_account
  * module.vm_automation_dtgtwy.azurerm_automation_job_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_job_schedule.vm-start-stop[&#34;vm-on&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_runbook.vm-start-stop
* Update
  * azapi_update_resource.ams_auth
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * azurerm_public_ip.pip
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.vm_automation.azurerm_automation_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation.azurerm_automation_schedule.vm-start-stop[&#34;vm-on&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop[&#34;vm-on&#34;]
* Delete
  * null_resource.amsid_02


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_update_resource.ams02_auth will be created
  + resource "azapi_update_resource" "ams02_auth" {
      + body                    = (known after apply)
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Media/mediaservices@2021-06-01"
    }

  # azapi_update_resource.ams_auth will be updated in-place
  ~ resource "azapi_update_resource" "ams_auth" {
      ~ body                    = jsonencode(
          ~ {
              ~ properties = {
                  ~ storageAccounts       = [
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Secondary" -> "Primary"
                        },
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Primary" -> "Secondary"
                        },
                    ]
                    # (1 unchanged element hidden)
                }
            }
        )
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg"
        name                    = "preamsstg"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[0] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "dtgtwyvm" {
      + daily_recurrence_time = "1800"
      + enabled               = true
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[1] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "dtgtwyvm" {
      + daily_recurrence_time = "1800"
      + enabled               = true
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_key_vault_secret.POSTGRES_PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "null-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "null-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_managed_disk.dtgtwaydatadisk[0] will be created
  + resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      + create_option                 = "Empty"
      + disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1000
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "predtgtwy0-datadisk-stg"
      + public_network_access_enabled = true
      + resource_group_name           = "pre-stg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + tier                          = (known after apply)
      + zone                          = "2"
    }

  # azurerm_managed_disk.dtgtwaydatadisk[1] will be created
  + resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      + create_option                 = "Empty"
      + disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1000
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "predtgtwy1-datadisk-stg"
      + public_network_access_enabled = true
      + resource_group_name           = "pre-stg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + tier                          = (known after apply)
      + zone                          = "2"
    }

  # azurerm_media_services_account.ams02 will be created
  + resource "azurerm_media_services_account" "ams02" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "preams02stg"
      + resource_group_name         = "pre-stg"
      + storage_authentication_type = (known after apply)
      + tags                        = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + key_delivery_access_control {
          + default_action = (known after apply)
          + ip_allow_list  = (known after apply)
        }

      + storage_account {
          + id         = (known after apply)
          + is_primary = false
        }
      + storage_account {
          + id         = (known after apply)
          + is_primary = true
        }
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_network_interface.dtgwnic[1] will be created
  + resource "azurerm_network_interface" "dtgwnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "pre-dtgwnic1-stg"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "pre-stg"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg"
        }
    }

  # azurerm_private_endpoint.finalsa will be created
  + resource "azurerm_private_endpoint" "finalsa" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prefinalsa-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prefinalsa-psc-stg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.ingestsa will be created
  + resource "azurerm_private_endpoint" "ingestsa" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prestream-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prestream-psc-stg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.sa will be created
  + resource "azurerm_private_endpoint" "sa" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "presa-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/res

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

.140.211.0/28",
              + "51.140.212.224/27",
              + "51.140.245.29",
              + "51.140.61.124",
              + "51.140.77.227",
              + "51.140.80.51",
              + "51.141.124.13",
              + "51.141.47.105",
              + "51.143.208.216/29",
              + "51.145.104.29/30",
              + "62.31.90.131",
              + "82.12.61.131",
              + "82.21.185.208",
              + "86.179.180.2",
              + "86.24.226.11",
            ]
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                              = "preingestsastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              - "82.44.92.214",
              + "86.179.180.2",
                # (48 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
        name                            = "pre-stg"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              + "80.44.26.160",
              + "86.179.180.2",
              - "90.243.1.130/32",
              - "90.247.65.225/32",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "developer" {
      ~ certificate_permissions = [
          - "List",
            "Get",
          - "GetIssuers",
          - "ListIssuers",
          + "List",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ key_permissions         = [
          - "List",
            "Get",
          + "List",
        ]
      ~ secret_permissions      = [
          - "List",
            "Get",
          + "List",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            "List",
          - "Get",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              - "82.44.92.214",
              + "86.179.180.2",
                # (48 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.vm_automation.azurerm_automation_schedule.vm-start-stop["vm-off"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-schedule-stop-vm-18-00-00"
        name                    = "pre-schedule-stop-vm-18-00-00"
      ~ start_time              = "2022-11-03T18:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation.azurerm_automation_schedule.vm-start-stop["vm-on"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-schedule-start-vm-06-00-00"
        name                    = "pre-schedule-start-vm-06-00-00"
      ~ start_time              = "2022-11-03T06:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation_dtgtwy.azurerm_automation_job_schedule.vm-start-stop["vm-off"] will be created
  + resource "azurerm_automation_job_schedule" "vm-start-stop" {
      + automation_account_name = "pre-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "mi_principal_id" = "591a788a-b993-4d63-b203-2576f2be42c1"
          + "resourcegroup"   = "pre-stg"
          + "start_vm"        = "false"
          + "vmlist"          = "predtgtwy0-stg,predtgtwy1-stg"
        }
      + resource_group_name     = "pre-stg"
      + runbook_name            = "pre-dtgtwy-vm-status-change-stg"
      + schedule_name           = "pre-dtgtwy-schedule-stop-vm-18-00-00"
    }

  # module.vm_automation_dtgtwy.azurerm_automation_job_schedule.vm-start-stop["vm-on"] will be created
  + resource "azurerm_automation_job_schedule" "vm-start-stop" {
      + automation_account_name = "pre-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "mi_principal_id" = "591a788a-b993-4d63-b203-2576f2be42c1"
          + "resourcegroup"   = "pre-stg"
          + "start_vm"        = "true"
          + "vmlist"          = "predtgtwy0-stg,predtgtwy1-stg"
        }
      + resource_group_name     = "pre-stg"
      + runbook_name            = "pre-dtgtwy-vm-status-change-stg"
      + schedule_name           = "pre-dtgtwy-schedule-start-vm-06-00-00"
    }

  # module.vm_automation_dtgtwy.azurerm_automation_runbook.vm-start-stop will be created
  + resource "azurerm_automation_runbook" "vm-start-stop" {
      + automation_account_name = "pre-stg-aa"
      + content                 = <<-EOT
            Param(
                [Parameter(Mandatory=$true)][ValidateNotNullOrEmpty()] 
                [String] 
                $mi_principal_id,
                [parameter(Mandatory=$true)][ValidateNotNullOrEmpty()]
            	[string]
                $vmlist,
                [Parameter(Mandatory=$true)][ValidateNotNullOrEmpty()] 
                [String] 
                $resourcegroup,    
                [Parameter(Mandatory=$true)][ValidateNotNullOrEmpty()] 
                [bool] 
                $start_vm
            )
            
            Write-Output "Script started at $(Get-Date -Format 'yyyy-MM-dd HH:mm:ss')"
            # Ensures you do not inherit an AzContext in your runbook
            Disable-AzContextAutosave -Scope Process | Out-Null
            # Connect to Azure with user-assigned managed identity
            # Don't do what Microsoft say - they use Client_Id here but it needs to be
            # the managed_identity_principal_id
            $AzureContext = (Connect-AzAccount -Identity -AccountId $mi_principal_id).context
            # set and store context
            $AzureContext = Set-AzContext -SubscriptionName $AzureContext.Subscription -DefaultProfile $AzureContext
            # Separate our vmlist into an array we can iterate over
            $VMssplit = $vmlist.Split(",") 
            [System.Collections.ArrayList]$VMs = $VMssplit
            
            # Loop through one or more VMs which will be passed in from the terraform as a list
            # If the list is empty it will skip the block
            foreach ($VM in $VMs){
                try { # Get status of VM
                $status = (Get-AzVM -ResourceGroupName $resourcegroup -Name $VM -Status -DefaultProfile $AzureContext).Statuses[1].Code
                Write-Output "Initial VM status for '$VM'= $status"
                } catch {
                    $ErrorMessage = $_.Exception.message
                    Write-Error ("Error getting the VM status of '$VM'  " + $ErrorMessage)
                    Break
                }
            
                if ( $start_vm -eq $false -and "PowerState/running","PowerState/starting","PowerState/unknown" -contains $status) {
                    Write-Output "The vm will be turned off" 
                    try{
                        Stop-AzVM -Name $VM -ResourceGroupName $resourcegroup -DefaultProfile $AzureContext -Force
                    } catch {
                        $ErrorMessage = $_.Exception.message
                        Write-Error ("Error stopping the VM $VM : " + $ErrorMessage)
                        Break
                    }
                } elseif( $start_vm -eq $true -and "PowerState/deallocated","PowerState/deallocating","PowerState/stopped","PowerState/stopping","PowerState/unknown" -contains $status) {
                    Write-Output "The vm will be turned on" 
                    try{
                        Start-AzVM -Name $VM -ResourceGroupName $resourcegroup -DefaultProfile $AzureContext
                        $ScriptToRun = "/home/wowza/runcmd.sh"
                        Out-File -InputObject $ScriptToRun -FilePath script.sh
                        Invoke-AzVMRunCommand -ResourceGroupName $resourcegroup -VMName $VM -CommandId 'RunShellScript' -ScriptPath script.sh
                    } catch {
                        $ErrorMessage = $_.Exception.message
                        Write-Error ("Error starting the VM $VM : " + $ErrorMessage)
                        Break
                    }
                } else {
                    Write-Output "The VM $VM is in the desired state"
                }
                $status = (Get-AzVM -ResourceGroupName $resourcegroup -Name $VM -Status -DefaultProfile $AzureContext).Statuses[1].Code
                Write-Output "Final $VM VM status: $status"
                Write-Output "`r`n"
            }
            
            
            Write-Output "Script ended at $(Get-Date -Format 'yyyy-MM-dd HH:mm:ss')"
            
        EOT
      + description             = "This is a powershell runbook used to stop and start pre-dtgtwy VMs"
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "uksouth"
      + log_progress            = false
      + log_verbose             = true
      + name                    = "pre-dtgtwy-vm-status-change-stg"
      + resource_group_name     = "pre-stg"
      + runbook_type            = "PowerShell"
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop["vm-off"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-dtgtwy-schedule-stop-vm-18-00-00"
        name                    = "pre-dtgtwy-schedule-stop-vm-18-00-00"
      ~ start_time              = "2022-11-03T18:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop["vm-on"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-dtgtwy-schedule-start-vm-06-00-00"
        name                    = "pre-dtgtwy-schedule-start-vm-06-00-00"
      ~ start_time              = "2022-11-03T06:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 42 to add, 16 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azapi_update_resource.ams02_auth has been deleted
  - resource "azapi_update_resource" "ams02_auth" {
      - body                    = jsonencode(
            {
              - properties = {
                  - storageAccounts       = [
                      - {
                          - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsa02stg"
                          - identity = {
                              - useSystemAssignedIdentity = false
                              - userAssignedIdentity      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourcegroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi"
                            }
                          - type     = "Secondary"
                        },
                      - {
                          - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsa02stg"
                          - identity = {
                              - useSystemAssignedIdentity = false
                              - userAssignedIdentity      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourcegroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi"
                            }
                          - type     = "Primary"
                        },
                    ]
                  - storageAuthentication = "ManagedIdentity"
                }
            }
        ) -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preams02stg" -> null
      - ignore_casing           = false -> null
      - ignore_missing_property = true -> null
      - name                    = "preams02stg" -> null
      - output                  = jsonencode({}) -> null
      - parent_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preams02stg" -> null
      - type                    = "Microsoft.Media/mediaservices@2021-06-01" -> null
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[0] has been deleted
  - resource "azurerm_dev_test_global_vm_shutdown_schedule" "dtgtwyvm" {
      - daily_recurrence_time = "1800" -> null
      - enabled               = true -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-predtgtwy0-stg" -> null
      - location              = "uksouth" -> null
      - tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone              = "GMT Standard Time" -> null
      - virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy0-stg" -> null

      - notification_settings {
          - enabled         = false -> null
          - time_in_minutes = 30 -> null
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[1] has been deleted
  - resource "azurerm_dev_test_global_vm_shutdown_schedule" "dtgtwyvm" {
      - daily_recurrence_time = "1800" -> null
      - enabled               = true -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-predtgtwy1-stg" -> null
      - location              = "uksouth" -> null
      - tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone              = "GMT Standard Time" -> null
      - virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy1-stg" -> null

      - notification_settings {
          - enabled         = false -> null
          - time_in_minutes = 30 -> null
        }
    }

  # azurerm_disk_encryption_set.pre-des has changed
  ~ resource "azurerm_disk_encryption_set" "pre-des" {
        id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des"
        name                      = "pre-des"
        tags                      = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_managed_disk.dtgtwaydatadisk[0] has been deleted
  - resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      - create_option                 = "Empty" -> null
      - disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
      - disk_iops_read_only           = 0 -> null
      - disk_iops_read_write          = 500 -> null
      - disk_mbps_read_only           = 0 -> null
      - disk_mbps_read_write          = 60 -> null
      - disk_size_gb                  = 1000 -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/predtgtwy0-datadisk-stg" -> null
      - location                      = "uksouth" -> null
      - max_shares                    = 0 -> null
      - name                          = "predtgtwy0-datadisk-stg" -> null
      - on_demand_bursting_enabled    = false -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "pre-stg" -> null
      - storage_account_type          = "Standard_LRS" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - trusted_launch_enabled        = false -> null
      - zone                          = "2" -> null
    }

  # azurerm_managed_disk.dtgtwaydatadisk[1] has been deleted
  - resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      - create_option                 = "Empty" -> null
      - disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
      - disk_iops_read_only           = 0 -> null
      - disk_iops_read_write          = 500 -> null
      - disk_mbps_read_only           = 0 -> null
      - disk_mbps_read_write          = 60 -> null
      - disk_size_gb                  = 1000 -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/predtgtwy1-datadisk-stg" -> null
      - location                      = "uksouth" -> null
      - max_shares                    = 0 -> null
      - name                          = "predtgtwy1-datadisk-stg" -> null
      - on_demand_bursting_enabled    = false -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "pre-stg" -> null
      - storage_account_type          = "Standard_LRS" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - trusted_launch_enabled        = false -> null
      - zone                          = "2" -> null
    }

  # azurerm_media_services_account.ams02 has been deleted
  - resource "azurerm_media_services_account" "ams02" {
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preams02stg" -> null
      - location                    = "uksouth" -> null
      - name                        = "preams02stg" -> null
      - resource_group_name         = "pre-stg" -> null
      - storage_authentication_type = "ManagedIdentity" -> null
      - tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null

      - identity {
          - principal_id = "9f6f1658-b187-4986-a23c-ae3c34b86cf3" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - key_delivery_access_control {
          - default_action = "Allow" -> null
          - ip_allow_list  = [] -> null
        }

      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsa02stg" -> null
          - is_primary = false -> null
        }
      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsa02stg" -> null
          - is_primary = true -> null
        }
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "Capacity"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + days    = 0
              + enabled = true
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - enabled = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "Capacity"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + days    = 0
              + enabled = true
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - enabled = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "Capacity"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + days    = 0
              + enabled = true
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - enabled = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_network_interface.dtgwnic[0] has changed
  ~ resource "azurerm_network_interface" "dtgwnic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic0-stg"
      - internal_domain_name_suffix   = "fruoojhui1cejntjhgup5ozttg.zx.internal.cloudapp.net" -> null
        name                          = "pre-dtgwnic0-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - virtual_machine_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy0-stg" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.dtgwnic[1] has been deleted
  - resource "azurerm_network_interface" "dtgwnic" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic1-stg" -> null
      - internal_domain_name_suffix   = "fruoojhui1cejntjhgup5ozttg.zx.internal.cloudapp.net" -> null
      - location                      = "uksouth" -> null
      - mac_address                   = "60-45-BD-C1-28-6B" -> null
      - name                          = "pre-dtgwnic1-stg" -> null
      - private_ip_address            = "10.101.0.197" -> null
      - private_ip_addresses          = [
          - "10.101.0.197",
        ] -> null
      - resource_group_name           = "pre-stg" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - virtual_machine_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy1-stg" -> null

      - ip_configuration {
          - name                          = "internal" -> null
          - primary                       = true -> null
          - private_ip_address            = "10.101.0.197" -> null
          - private_ip_address_allocation = "Dynamic" -> null
          - private_ip_address_version    = "IPv4" -> null
          - subnet_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg" -> null
        }
    }

  # azurerm_private_endpoint.finalsa has been deleted
  - resource "azurerm_private_endpoint" "finalsa" {
      - custom_dns_configs       = [
          - {
              - fqdn         = "prefinalsastg.blob.core.windows.net"
              - ip_addresses = [
                  - "10.101.0.70",
                ]
            },
        ] -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/prefinalsa-pe-stg" -> null
      - location                 = "uksouth" -> null
      - name                     = "prefinalsa-pe-stg" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/prefinalsa-pe-stg.nic.4078d248-3e58-406a-b50e-103c41fbb811"
              - name = "prefinalsa-pe-stg.nic.4078d248-3e58-406a-b50e-103c41fbb811"
            },
        ] -> null
      - private_dns_zone_configs = [] -> null
      - resource_group_name      = "pre-stg" -> null
      - subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg" -> null
      - tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null

      - private_service_connection {
          - is_manual_connection      

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ays = 365 -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [
              - "20.108.81.107/30",
              - "20.49.145.249/30",
              - "20.49.166.118/30",
              - "20.49.166.129/30",
              - "20.49.166.40/30",
              - "20.49.244.238/30",
              - "20.58.70.192/27",
              - "20.58.70.224/28",
              - "20.90.124.134",
              - "20.90.125.211",
              - "20.90.129.0/27",
              - "20.90.129.32/28",
              - "20.90.131.0/26",
              - "20.90.131.120/29",
              - "20.90.131.64/27",
              - "20.90.169.112/30",
              - "51.104.248.11/30",
              - "51.104.30.172/30",
              - "51.104.30.192/26",
              - "51.104.31.0/27",
              - "51.104.31.32/28",
              - "51.104.31.48/29",
              - "51.104.31.64/26",
              - "51.105.77.96/27",
              - "51.11.172.160/30",
              - "51.11.172.30/30",
              - "51.11.172.56/30",
              - "51.11.24.198/30",
              - "51.11.25.172/30",
              - "51.11.25.68/30",
              - "51.132.161.225/30",
              - "51.132.215.162/30",
              - "51.132.215.182/30",
              - "51.140.148.0/28",
              - "51.140.211.0/28",
              - "51.140.212.224/27",
              - "51.140.245.29",
              - "51.140.61.124",
              - "51.140.77.227",
              - "51.140.80.51",
              - "51.141.124.13",
              - "51.141.47.105",
              - "51.143.208.216/29",
              - "51.145.104.29/30",
              - "62.31.90.131",
              - "82.12.61.131",
              - "82.21.185.208",
              - "82.44.92.214",
              - "86.24.226.11",
            ] -> null
          - virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.key-vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (2 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Get",
                ]
                object_id               = "2757c27a-aa98-4cdf-9aaa-90cf47d0656c"
                secret_permissions      = [
                    "List",
                    "Set",
                    "Delete",
                    "Get",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          ~ {
              ~ certificate_permissions = [
                  - "Get",
                    "List",
                  + "Get",
                  + "GetIssuers",
                  + "ListIssuers",
                ]
              ~ key_permissions         = [
                  - "Get",
                    "List",
                  + "Get",
                ]
              ~ secret_permissions      = [
                  - "Get",
                    "List",
                  + "Get",
                ]
              ~ storage_permissions     = [
                  + "List",
                  + "Get",
                ]
                # (3 unchanged elements hidden)
            },
          ~ {
              ~ certificate_permissions = [
                    "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  + "Get",
                    "GetIssuers",
                    "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              ~ key_permissions         = [
                    "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  + "Get",
                ]
              ~ secret_permissions      = [
                    "List",
                  - "Set",
                  - "Delete",
                  + "Get",
                ]
              ~ storage_permissions     = [
                  + "List",
                  + "Get",
                ]
                # (3 unchanged elements hidden)
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Get",
                ]
                object_id               = "64e5c2d9-c957-4038-873f-7eb4e6250c7d"
                secret_permissions      = [
                    "List",
                    "Set",
                    "Delete",
                    "Get",
                ]
                storage_permissions     = [
                    "List",
                    "Set",
                    "Delete",
                    "Get",
                ]
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
        name                            = "pre-stg"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] has changed
  ~ resource "azurerm_key_vault_access_policy" "developer" {
      ~ certificate_permissions = [
          - "Get",
            "List",
          + "Get",
          + "GetIssuers",
          + "ListIssuers",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ key_permissions         = [
          - "Get",
            "List",
          + "Get",
        ]
      ~ secret_permissions      = [
          - "Get",
            "List",
          + "Get",
        ]
      ~ storage_permissions     = [
          + "List",
          + "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy has changed
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          + "Get",
            "GetIssuers",
            "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          + "Get",
        ]
      ~ secret_permissions      = [
            "List",
          - "Set",
          - "Delete",
          + "Get",
        ]
      ~ storage_permissions     = [
          + "List",
          + "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }

  # module.vm_automation_dtgtwy.azurerm_automation_job_schedule.vm-start-stop["vm-off"] has been deleted
  - resource "azurerm_automation_job_schedule" "vm-start-stop" {
      - automation_account_name = "pre-stg-aa" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/jobSchedules/798c4870-f5ee-442d-9fe9-5fe0136abc85" -> null
      - job_schedule_id         = "798c4870-f5ee-442d-9fe9-5fe0136abc85" -> null
      - parameters              = {
          - "mi_principal_id" = "591a788a-b993-4d63-b203-2576f2be42c1"
          - "resourcegroup"   = "pre-stg"
          - "start_vm"        = "false"
          - "vmlist"          = "predtgtwy0-stg,predtgtwy1-stg"
        } -> null
      - resource_group_name     = "pre-stg" -> null
      - runbook_name            = "pre-dtgtwy-vm-status-change-stg" -> null
      - schedule_name           = "pre-dtgtwy-schedule-stop-vm-18-00-00" -> null
    }

  # module.vm_automation_dtgtwy.azurerm_automation_job_schedule.vm-start-stop["vm-on"] has been deleted
  - resource "azurerm_automation_job_schedule" "vm-start-stop" {
      - automation_account_name = "pre-stg-aa" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/jobSchedules/bc09a582-7840-4688-935f-7220c96c5055" -> null
      - job_schedule_id         = "bc09a582-7840-4688-935f-7220c96c5055" -> null
      - parameters              = {
          - "mi_principal_id" = "591a788a-b993-4d63-b203-2576f2be42c1"
          - "resourcegroup"   = "pre-stg"
          - "start_vm"        = "true"
          - "vmlist"          = "predtgtwy0-stg,predtgtwy1-stg"
        } -> null
      - resource_group_name     = "pre-stg" -> null
      - runbook_name            = "pre-dtgtwy-vm-status-change-stg" -> null
      - schedule_name           = "pre-dtgtwy-schedule-start-vm-06-00-00" -> null
    }

  # module.vm_automation_dtgtwy.azurerm_automation_runbook.vm-start-stop has been deleted
  - resource "azurerm_automation_runbook" "vm-start-stop" {
      - automation_account_name  = "pre-stg-aa" -> null
      - content                  = <<-EOT
            Param(
                [Parameter(Mandatory=$true)][ValidateNotNullOrEmpty()] 
                [String] 
                $mi_principal_id,
                [parameter(Mandatory=$true)][ValidateNotNullOrEmpty()]
            	[string]
                $vmlist,
                [Parameter(Mandatory=$true)][ValidateNotNullOrEmpty()] 
                [String] 
                $resourcegroup,    
                [Parameter(Mandatory=$true)][ValidateNotNullOrEmpty()] 
                [bool] 
                $start_vm
            )
            
            Write-Output "Script started at $(Get-Date -Format 'yyyy-MM-dd HH:mm:ss')"
            # Ensures you do not inherit an AzContext in your runbook
            Disable-AzContextAutosave -Scope Process | Out-Null
            # Connect to Azure with user-assigned managed identity
            # Don't do what Microsoft say - they use Client_Id here but it needs to be
            # the managed_identity_principal_id
            $AzureContext = (Connect-AzAccount -Identity -AccountId $mi_principal_id).context
            # set and store context
            $AzureContext = Set-AzContext -SubscriptionName $AzureContext.Subscription -DefaultProfile $AzureContext
            # Separate our vmlist into an array we can iterate over
            $VMssplit = $vmlist.Split(",") 
            [System.Collections.ArrayList]$VMs = $VMssplit
            
            # Loop through one or more VMs which will be passed in from the terraform as a list
            # If the list is empty it will skip the block
            foreach ($VM in $VMs){
                try { # Get status of VM
                $status = (Get-AzVM -ResourceGroupName $resourcegroup -Name $VM -Status -DefaultProfile $AzureContext).Statuses[1].Code
                Write-Output "Initial VM status for '$VM'= $status"
                } catch {
                    $ErrorMessage = $_.Exception.message
                    Write-Error ("Error getting the VM status of '$VM'  " + $ErrorMessage)
                    Break
                }
            
                if ( $start_vm -eq $false -and "PowerState/running","PowerState/starting","PowerState/unknown" -contains $status) {
                    Write-Output "The vm will be turned off" 
                    try{
                        Stop-AzVM -Name $VM -ResourceGroupName $resourcegroup -DefaultProfile $AzureContext -Force
                    } catch {
                        $ErrorMessage = $_.Exception.message
                        Write-Error ("Error stopping the VM $VM : " + $ErrorMessage)
                        Break
                    }
                } elseif( $start_vm -eq $true -and "PowerState/deallocated","PowerState/deallocating","PowerState/stopped","PowerState/stopping","PowerState/unknown" -contains $status) {
                    Write-Output "The vm will be turned on" 
                    try{
                        Start-AzVM -Name $VM -ResourceGroupName $resourcegroup -DefaultProfile $AzureContext
                        $ScriptToRun = "/home/wowza/runcmd.sh"
                        Out-File -InputObject $ScriptToRun -FilePath script.sh
                        Invoke-AzVMRunCommand -ResourceGroupName $resourcegroup -VMName $VM -CommandId 'RunShellScript' -ScriptPath script.sh
                    } catch {
                        $ErrorMessage = $_.Exception.message
                        Write-Error ("Error starting the VM $VM : " + $ErrorMessage)
                        Break
                    }
                } else {
                    Write-Output "The VM $VM is in the desired state"
                }
                $status = (Get-AzVM -ResourceGroupName $resourcegroup -Name $VM -Status -DefaultProfile $AzureContext).Statuses[1].Code
                Write-Output "Final $VM VM status: $status"
                Write-Output "`r`n"
            }
            
            
            Write-Output "Script ended at $(Get-Date -Format 'yyyy-MM-dd HH:mm:ss')"
            
        EOT -> null
      - description              = "This is a powershell runbook used to stop and start pre-dtgtwy VMs" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/runbooks/pre-dtgtwy-vm-status-change-stg" -> null
      - job_schedule             = [
          - {
              - job_schedule_id = "bc09a582-7840-4688-935f-7220c96c5055"
              - parameters      = {}
              - run_on          = ""
              - schedule_name   = "pre-dtgtwy-schedule-start-vm-06-00-00"
            },
        ] -> null
      - location                 = "uksouth" -> null
      - log_activity_trace_level = 0 -> null
      - log_progress             = false -> null
      - log_verbose              = true -> null
      - name                     = "pre-dtgtwy-vm-status-change-stg" -> null
      - resource_group_name      = "pre-stg" -> null
      - runbook_type             = "PowerShell" -> null
      - tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":186,"Program":"tfcmt","SHA1":"","Vars":{}} -->